[
  {
    "id": 1,
    "name": "Learn Angular",
    "image": "http://tutorio-bootstrap.frontendmatter.com/assets/images/paths/angular_430x168.png",
    "instructor": "David Deo",
    "ins_img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80",
    "rating": 4.5,
    "details": "Learn the fundamentals of working with Angular and how to create basic applications.",
    "description": "From Setup to Deployment, this course covers it all! You'll learn all about Components, Directives, Services, Forms, Http Access, Authentication, Optimizing an Angular App with Modules and Offline Compilation and much more - and in the end: You'll learn how to deploy an application! But that's not all! This course will also show you how to use the Angular CLI and feature a complete project, which allows you to practice the things learned throughout the course! And if you do get stuck, you benefit from an extremely fast and friendly support - both via direct messaging or discussion. You have my word!. Angular is one of the most modern, performance-efficient and powerful frontend frameworks you can learn as of today. It allows you to build great web apps which offer awesome user experiences! Learn all the fundamentals you need to know to get started developing Angular applications right away.",
    "enrolled": 999,
    "price": 99
  },
  {
    "id": 2,
    "name": "Build an iOS Application in Swift",
    "image": "http://tutorio-bootstrap.frontendmatter.com/assets/images/paths/swift_430x168.png",
    "instructor": "Natasha Costa",
    "ins_img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80",
    "rating": 4.7,
    "details": "Learn the fundamentals of working with Swift and how to create basic iOS applications.",
    "description": "The course includes 55+ hours of HD video tutorials and builds your programming knowledge while making real world apps. e.g. Pokemon Go, Whatsapp, QuizUp and Yahoo Weather.The curriculum has been completely revamped for iOS 13 and Xcode 11. Including comprehensive modules on Apple's latest technology - SwiftUI iOS, iPadOS and macOS app interface design, ARKit for making Augmented Reality apps as well as CoreML & CreateML for making intelligent apps with Machine Learning. You'll be building 3D augmented reality apps that look like Pokemon Go and Harry Potter's magical newspapers! By the end of this course, you will be fluently programming in Swift 5.1 and be ready to make your own apps or start a freelancing job as an iOS 13 developer.You'll also have a portfolio of over 25 apps that you can show off to any potential employer.",
    "enrolled": 1020,
    "price": 110
  },
  {
    "id": 3,
    "name": "Introduction to Typescript",
    "image": "http://tutorio-bootstrap.frontendmatter.com/assets/images/paths/typescript_430x168.png",
    "instructor": "Avli Haque",
    "ins_img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80",
    "rating": 4.5,
    "details": "Learn the fundamentals of working with Typescript and how to create basic applications.",
    "description": "Do you want to build Angular, React JS, or Vue JS web and mobile applications? If that's your goal it's vital that you learn the TypeScript programming language, and that's exactly what we're going to walk through in this course. My name is Jordan Hudgens, and I'll be your instructor for the course. In addition to being the lead instructor for devCamp I've also been building web applications for over a decade for organizations such as Eventbrite and Quip. My focus for this course isn't to teach you how to build TypeScript console applications. Instead, my goal is to teach you the skills you will need in order to build real world Angular 2 applications. And actually, this course includes the exact material we teach at our devCamp coding bootcamps prior to students going through our immersive Angular 2 course. There are no technical pre-requisites to this course. The ideal student is an individual who wants to learn how to build Angular 2 applications. I will show you how to install and run TypeScript programs on both a Mac and a PC. And you can use either operating system to follow along with the course material.",
    "enrolled": 1200,
    "price": 89
  },
  {
    "id": 4,
    "name": "Learn React Native",
    "image": "http://tutorio-bootstrap.frontendmatter.com/assets/images/paths/react_430x168.png",
    "instructor": "Robert Dickson",
    "ins_img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80",
    "rating": 4.9,
    "details": "Learn the fundamentals of working with React Native and how to create basic Android applications.",
    "description": "Using the latest version of React Native, this course is focused on efficiency. Never spend time on confusing, out of date, incomplete tutorials anymore, and instead, learn to build professional and modern Android and iPhone (iOS) apps! Graduates of Andrei’s courses are now working at Google, Tesla, Amazon, Apple, IBM, JP Morgan, Facebook, + other top tech companies. We guarantee you this is the most comprehensive online resource on React Native. This project based course will introduce you to all of the modern toolchain of a React Native app developer in 2022. Along the way, we will build a massive restaurant application using React, React Hooks, Expo, React Navigation, Firebase, Styled-Components, Google Maps/Places API, React Animations, Stripe Payments, + more. This is going to be a full iOS and Android app!",
    "enrolled": 1099,
    "price": 100
  },
  {
    "id": 5,
    "name": "Be a Wordpress Developer",
    "image": "http://tutorio-bootstrap.frontendmatter.com/assets/images/paths/wordpress_430x168.png",
    "instructor": "Samuel Paul",
    "ins_img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80",
    "rating": 4.8,
    "details": "Learn the fundamentals of working with Wordpress and how to create modern Wordpress Website.",
    "description": "Hello! Welcome to the WordPress development course. This is the most comprehensive and effective course on WordPress development around. This is the only course you'll ever need to learn WordPress development. In this course, I will teach you how to create your very own plugins and themes. This course was designed for those who truly want to master WordPress inside and out. There is no stone left unturned. This course will help make you into one of the most competitive WordPress developers out there. You will be able to develop custom plugins and themes no matter how hard the task is.",
    "enrolled": 1200,
    "price": 69
  },
  {
    "id": 6,
    "name": "Angular Unit Testing",
    "image": "http://tutorio-bootstrap.frontendmatter.com/assets/images/paths/angular_testing_430x168.png",
    "instructor": "Elijah Murray",
    "ins_img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80",
    "rating": 4.8,
    "details": "Learn the fundamentals of working with Angular Unit Testing and how to testing basic applications.",
    "description": "Starting from scratch, we are going to introduce behavior-driven testing concepts, by quickly introducing the main concepts and utilities of the Jasmine Testing framework. We are then going to introduce some testing best practices, and we are going to talk about mocks and Jasmine spies. We will then introduce some of the Angular Testing utilities such as the Angular TestBed, which we will be using to test a couple of simple Angular services.We are going to learn how to test Angular components with and without the DOM, what parts of the component to test, and we are going to cover in detail asynchronous tests using the fakeAsync and async utilities.",
    "enrolled": 500,
    "price": 120
  }
]
